config.org
** Deft
Set =deft= directory.

#+begin_src emacs-lisp
(setq deft-directory "/Users/ste/Library/Mobile Documents/com~apple~CloudDocs/drive/deft"
      deft-extensions '("org", "md", "txt", "tex")
      deft-recursive t)
#+end_src
** Dired
Open file with external program. Bound to =SPC k e=.

#+begin_src emacs-lisp :tangle init.el
(defun open-in-external-app (&optional @fname)
  "Open the current file or dired marked files in external app.
When called in emacs lisp, if @fname is given, open that.
URL `http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html'
Version 2019-11-04 2021-02-16"
  (interactive)
  (let* (
         ($file-list
          (if @fname
              (progn (list @fname))
            (if (string-equal major-mode "dired-mode")
                (dired-get-marked-files)
              (list (buffer-file-name)))))
         ($do-it-p (if (<= (length $file-list) 5)
                       t
                     (y-or-n-p "Open more than 5 files? "))))
    (when $do-it-p
      (cond
       ((string-equal system-type "windows-nt")
        (mapc
         (lambda ($fpath)
           (shell-command (concat "PowerShell -Command \"Invoke-Item -LiteralPath\" " "'" (shell-quote-argument (expand-file-name $fpath )) "'")))
         $file-list))
       ((string-equal system-type "darwin")
        (mapc
         (lambda ($fpath)
           (shell-command
            (concat "open " (shell-quote-argument $fpath))))  $file-list))
       ((string-equal system-type "gnu/linux")
        (mapc
         (lambda ($fpath) (let ((process-connection-type nil))
                            (start-process "" nil "xdg-open" $fpath))) $file-list))))))
#+end_src
** Forge
Set variables for =forge=.

#+begin_src emacs-lisp
(setq auth-sources '("~/.authinfo")
      forge-owned-accounts '(("stefanocoretta" . nil)
                             ("learnB4SS" . nil)
                             ("many-speech-analyses" . nil)))
#+end_src
** Magit
Set magit repo directories and depth.

#+begin_src emacs-lisp
(setq magit-repository-directories
      '(("~/repos" . 2)))
#+end_src

Customise repolist flags.

#+begin_src emacs-lisp
(setq magit-repolist-column-flag-alist
             '((magit-untracked-files . "  ❕️  ")
               (magit-unstaged-files . "  🟠  ")
               (magit-staged-files . "  🟢  ")))
#+end_src

Customise repolist columns.

#+begin_src emacs-lisp
(setq magit-repolist-columns
  '(("Name"     25 magit-repolist-column-ident nil)
    ("Version"  25 magit-repolist-column-version nil)
    (""   5 magit-repolist-column-flag nil)
    ("B<U"      3 magit-repolist-column-unpulled-from-upstream
      ((:right-align t)
       (:help-echo "Upstream changes not in branch")))
    ("B>U"      3 magit-repolist-column-unpushed-to-upstream
      ((:right-align t)
       (:help-echo "Local changes not in upstream")))
    ("Path"     99 magit-repolist-column-path nil)))
#+end_src
** Projectile
Set projectile search path and disable automatic discover.

#+begin_src emacs-lisp
(setq projectile-project-search-path
      '("~/repos" "~/repos/conlang" "~/repos/research" "~/repos/software" "~/repos/typography" "~/repos/web" "~/repos/b4ss" "~/repos/many-speech" "~/repos/teaching")
      projectile-auto-discover nil)
#+end_src
** Roam
Set =roam= directory.

#+begin_src emacs-lisp
(setq org-roam-directory "/Users/ste/Library/Mobile Documents/com~apple~CloudDocs/drive/roam" )
#+end_src

Define custom template.

#+begin_src emacs-lisp
(setq org-roam-capture-templates
      '(("d" "default" plain #'org-roam-capture--get-point "%?" :file-name "${slug}" :head "#+title: ${title}\n#+date: %t\n" :unnarrowed t)))
#+end_src

Use =org-roam-bibtex=.

#+begin_src emacs-lisp :tangle packages.el
(package! org-roam-bibtex
  :recipe (:host github :repo "org-roam/org-roam-bibtex"))

;; When using org-roam via the `+roam` flag
(unpin! org-roam)

;; When using bibtex-completion via the `biblio` module
(unpin! bibtex-completion helm-bibtex ivy-bibtex)
#+end_src

#+begin_src emacs-lisp
(use-package! org-roam-bibtex
  :after org-roam
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :config
  (require 'org-ref)) ; optional: if Org Ref is not loaded anywhere else, load it here
#+end_src
** Spell-fu
Set =ispell-dictionary= and disable global activation.

#+begin_src emacs-lisp
(setq ispell-dictionary "en")
(remove-hook 'text-mode-hook #'spell-fu-mode)
#+end_src
** Zetteldeft
Use =zetteldeft=.
#+begin_src emacs-lisp :tangle packages.el
(package! zetteldeft)
#+end_src

#+begin_src emacs-lisp
(use-package! zetteldeft
  :after deft
  :config
    (zetteldeft-set-classic-keybindings))
#+end_src

Define keymaps.

#+begin_src emacs-lisp
(map!
  :leader
  :prefix ("d" . "deft")
  :desc "deft" "d" #'deft
  :desc "new serch" "D" #'zetteldeft-deft-new-search
  :desc "refresh" "R" #'deft-refresh
  :desc "search at point" "s" #'zetteldeft-search-at-point
  :desc "search current id" "c" #'zetteldeft-search-current-id
  :desc "follow link" "f" #'zetteldeft-follow-link
  :desc "avy file othe window" "F" #'zetteldeft-avy-file-search-ace-window
  :desc "browse" "." #'zetteldeft-browse
  :desc "go home" "h" #'zetteldeft-go-home
  :desc "avy link search" "l" #'zetteldeft-avy-link-search
  :desc "avy tag search" "t" #'zetteldeft-avy-tag-search
  :desc "tag list" "T" #'zetteldeft-tag-buffer
  :desc "insert tag" "#" #'zetteldeft-tag-insert
  :desc "search tag" "/" #'zetteldeft-search-tag
  :desc "insert id" "i" #'zetteldeft-find-file-id-insert
  :desc "insert full title" "I" #'zetteldeft-find-file-full-title-insert
  :desc "find file" "o" #'zetteldeft-find-file
  :desc "new file" "n" #'zetteldeft-new-file
  :desc "new file & link" "N" #'zetteldeft-new-file-and-link
  :desc "new file & backlink" "B" #'zetteldeft-new-file-and-backlink
  :desc "add link" "b" #'zetteldeft-backlink-add
  :desc "rename" "r" #'zetteldeft-file-rename
  :desc "count words" "x" #'zetteldeft-count-words)
#+end_src
* Languages
** BibTeX
Define auto-key generation.

#+begin_src emacs-lisp
(setq bibtex-autokey-name-year-separator ""
      bibtex-autokey-year-title-separator ""
      bibtex-autokey-year-length 4
      bibtex-autokey-titleword-length 0
      bibtex-autokey-titlewords 0)
#+end_src

Set variables.

#+begin_src emacs-lisp
(setq bibtex-align-at-equal-sign t
      bibtex-comma-after-last-field t
      bibtex-entry-format '(opt-or-altr required-fields numerical-fields realign last-comma sort-fields) )
#+end_src

Keep entry sorted.

#+begin_src emacs-lisp
(setq-default bibtex-maintain-sorted-entries t)
#+end_src

Use =ivy-bibtex=.

#+begin_src emacs-lisp :tangle packages.el
(package! ivy-bibtex)
#+end_src

Set main bib and PDFs location.

#+begin_src emacs-lisp
(setq bibtex-completion-bibliography '("/Users/ste/texmf/bibtex/bib/linguistics.bib")
      bibtex-completion-library-path '("/Users/ste/Library/Mobile Documents/com~apple~CloudDocs/drive/biblio")
      bibtex-completion-notes-path "/Users/ste/Library/Mobile Documents/com~apple~CloudDocs/drive/roam")
#+end_src

Use =org-ref=.

#+begin_src emacs-lisp :tangle packages.el
(package! org-ref)
#+end_src

Set =org-ref= variables.

#+begin_src emacs-lisp
(setq reftex-default-bibliography '("/Users/ste/texmf/bibtex/bib/linguistics.bib"))

;; see org-ref for use of these variables
(setq org-ref-bibliography-notes "/Users/ste/Library/Mobile Documents/com~apple~CloudDocs/drive/roam"
      org-ref-default-bibliography '("/Users/ste/texmf/bibtex/bib/linguistics.bib")
      org-ref-pdf-directory "/Users/ste/Library/Mobile Documents/com~apple~CloudDocs/drive/biblio")
#+end_src
** CSV
Use =csv-mode=.

#+begin_src emacs-lisp :tangle packages.el
(package! csv-mode)
#+end_src

Rainbow csv (from https://www.reddit.com/r/emacs/comments/26c71k/csv_column_highlighting/chq2r8m?utm_source=share&utm_medium=web2x&context=3).
Customised so every column is coloured.

#+begin_src emacs-lisp :tangle init.el
(require 'cl)
(require 'color)

(defun csv-highlight (&optional separator)
  (interactive (list (when current-prefix-arg (read-char "Separator: "))))
  (font-lock-mode 1)
  (let* ((separator (or separator ?\,))
         (n (count-matches (string separator) (point-at-bol) (point-at-eol)))
         (colors (loop for i from 0 to 1.0 by (/ 1.0 n)
                       collect (apply #'color-rgb-to-hex
                                      (color-hsl-to-rgb i 0.7 0.5)))))
    (loop for i from 1 to n by 1
          for c in colors
          for r = (format "^\\([^%c\n]+%c\\)\\{%d\\}" separator separator i)
          do (font-lock-add-keywords nil `((,r (1 '(face (:foreground ,c)))))))))

(defun my-csv-mode-hook ()
  (csv-highlight))

(add-hook 'csv-mode-hook 'my-csv-mode-hook)
#+end_src
** Lexurgy
Use =lexurgy-mode=.

#+begin_src emacs-lisp
(load! "lexurgy-mode.el")

(setq load-path (cons "~/emacs" load-path))
(autoload 'lexurgy-mode "lexurgy" "Enter Lexurgy mode." t)
(setq auto-mode-alist (cons '("\\.lsc$" . lexurgy-mode) auto-mode-alist))
(autoload 'lexurgy-wlm-mode "lexurgy wlm" "Enter Lexurgy WLM mode." t)
(setq auto-mode-alist (cons '("\\.wl\\(m\\|i\\)$" . lexurgy-wlm-mode) auto-mode-alist))
#+end_src
** Markdown
Use =raw_attribute=.

#+begin_src emacs-lisp
(setq markdown-code-lang-modes
  '(("ocaml" . tuareg-mode) ("elisp" . emacs-lisp-mode) ("ditaa" . artist-mode)
    ("asymptote" . asy-mode) ("dot" . fundamental-mode) ("sqlite" . sql-mode)
    ("calc" . fundamental-mode) ("C" . c-mode) ("cpp" . c++-mode)
    ("C++" . c++-mode) ("screen" . shell-script-mode) ("shell" . sh-mode)
    ("bash" . sh-mode) ("=latex" . latex-mode)))
#+end_src
** Pandoc
Use =pandoc-mode=.

#+begin_src emacs-lisp :tangle packages.el
(package! pandoc-mode)
#+end_src

Autoload with markdown.

#+begin_src emacs-lisp :tangle init.el
(add-hook 'pandoc-mode-hook 'pandoc-load-default-settings)
#+end_src
** Praat
Use =praat-mode=.

#+begin_src emacs-lisp
(load! "praat-script-mode.el")

(setq load-path (cons "~/emacs" load-path))
(autoload 'praat-script-mode "praat" "Enter Praat mode." t)
(setq auto-mode-alist (cons '("\\.praat$" . praat-script-mode) auto-mode-alist))
#+end_src
