config.org
** R
Don't ask for working directory when starting R inferior process.

#+begin_src emacs-lisp
(setq ess-ask-for-ess-directory nil)
#+end_src

Auto =ess-r-mode= with =.secrets= file.

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist
             '("\\.secrets\\'" . ess-r-mode))
#+end_src

Auto =css-mode= with =rstheme= file.

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist
             '("\\.rstheme\\'" . css-mode))
#+end_src

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist
             '("\\.Rproj$" . yaml-mode))
#+end_src
* Org-mode
** Customise
Number sections and start folded.

#+begin_src emacs-lisp
(after! org
  (setq org-startup-numerated nil)
  (setq org-startup-folded t))
#+end_src

Use =org-bullets=.

#+begin_src emacs-lisp :tangle packages.el
(package! org-bullets)
;; also need magit-section
(package! magit-section)
#+end_src

#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src
** Org Agenda
Set agenda file and other variables.

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files '("/Users/ste/Library/Mobile Documents/iCloud~com~appsonthemove~beorg/Documents/org/agenda.org"))
  (setq org-agenda-span 14)
  (setq org-agenda-start-on-weekday 1)
  (setq org-directory "/Users/ste/Library/Mobile Documents/com~apple~CloudDocs/drive/roam"))
#+end_src

#+begin_src emacs-lisp
(add-hook 'org-agenda-finalize-hook
  (lambda ()
    (save-excursion
      (color-org-header "Meetings:" "SeaGreen" "white")
      (color-org-header "Attend:" "DarkOrange" "black")
      (color-org-header "Engage:" "MediumPurple" "white")
      (color-org-header "Personal:" "red4" "white"))))

(defun color-org-header (tag backcolor forecolor)
  ""
  (interactive)
  (goto-char (point-min))
  (while (re-search-forward tag nil t)
    (add-text-properties (match-beginning 0) (+ (match-beginning 0) 10)
                     `(face (:background, backcolor, :foreground, forecolor)))))
#+end_src
** Priorities
Use =org-fancy-priorities= to customise priority cookies.

#+begin_src emacs-lisp :tangle packages.el
(package! org-fancy-priorities)
#+end_src

#+begin_src emacs-lisp
(add-hook 'org-agenda-mode-hook 'org-fancy-priorities-mode)

(after! org-fancy-priorities
  (setq org-priority-faces '((?A :foreground "#e45649")
                             (?B :foreground "#da8548")
                             (?C :foreground "#0098dd"))
        org-fancy-priorities-list '("⬢" "⬢" "⬢")))
#+end_src
